#include <iostream>
using namespace std;

int main(){
	/*
		2、二位数元素个数：行*列
		3、二维数组取值：int 数组名[行下标][列下标]
		4、二维数组初始化
			4.1：分行赋值(未赋值部分默认为0)
				完全初始化：数据类型 数组名[行长度][列长度]={{值1, 值2...},{值1, 值2...}...}
				部分初始化：数据类型 数组名[行长度][列长度]={{值1, 值2...},{}...}
			4.2：顺序赋值
				数据类型 数组名[行长度][列长度]={{值1, 值2, 值3...}
	*/
	
	//完全初始化
	int arr[2][3] = {{1, 2, 3}, {4, 5, 6}};
	for (int i = 0; i < 2; i++){
		for (int j = 0; j < 3; j++){
			cout << arr[i][j];
		}
		cout << endl;
	}
	//部分初始化
	int arr1[2][3] = {{1, 2}, {4}};
	for (int i = 0; i < 2; i++){
		for (int j = 0; j < 3; j++){
			cout << arr1[i][j];
		}
		cout << endl;
	}
}
